In [1]:
# 데이터 입력

fruit = open('fruit.txt', 'wt')

fruit_price = {'apple':3500, 'peer':2500, 'cherry':5000}
for item in fruit_price.items():
    print(item, file = fruit)

fruit.close()

In [2]:
# 데이터 출력

fruit = open('fruit2.txt', 'wt')

fruit.write('apple 2500\n')
fruit.write('peer 2500\n')
fruit.write('cherry 5000\n')

fruit.close()

In [3]:
# write() csv 데이터 입력

import csv

with open('fruit.csv', 'w', newline='') as fruit:
    writer = csv.writer(fruit, delimiter=',')
    writer.writerow(['apple'])
    writer.writerow(['peer'])
    writer.writerow(['cherry'])
    writer.writerow(['banana'])
    writer.writerow(['peach'])

In [4]:
# 데이터 읽어오기

fruit_path = open('fruit.txt', 'rt')

fruit_path
fruit = fruit_path.readlines()

print(fruit)

["('apple', 3500)\n", "('peer', 2500)\n", "('cherry', 5000)\n"]

In [5]:
# csv 읽어오기

f = open('fruit.csv', 'rt')
csvRead = csv.reader(f)
print(csvRead)

fruit = []

for i in csvRead:
    fruit.append(csvRead)
    print(i)

<_csv.reader object at 0x000002398C4D8040>
['apple']
['peer']
['cherry']
['banana']
['peach']

디지털 뉴딜
https://v.kakao.com/v/20210722154658210?fbclid=IwAR0cAHQxQVwZrnebaHRBqJmawfkMi89gQ2nNIID5z_BbKhMHtqEhNjdE3xg

AI개발자 커뮤니티
http://aidev.co.kr/?fbclid=IwAR2UfCOFk2JLqldMEzveIqIN12HykUvewybq8U6Bj7zzm10nTpcwnpy26gI

In [6]:
# 실습08 자연수의 홀수 짝수 구분
# 1. 1에서 20까지 3으로 나누어떨어지는 요소를 갖는 num 리스트 구성
# 2. num의 숫자의 홀수, 짝수 판별
# 3. "3은 홀수 입니다."

num = []

for i in range(1, 21):
    if i % 3 == 0:
        num.append(i)

for j in num:
    if j % 2 == 0:
        pm = '짝수'
    else:
        pm = '홀수'
    print('{}은(는) {}입니다.'.format(j, pm))

3은(는) 홀수입니다.
6은(는) 짝수입니다.
9은(는) 홀수입니다.
12은(는) 짝수입니다.
15은(는) 홀수입니다.
18은(는) 짝수입니다.

In [7]:
# 실습10 for, if, range, type 혼합
# 1. 6개의 원소를 [1, 9, 'one', 'two', 3, 'three'] 갖는 리스트 val 구성
# 2. 마지막 원소를 자기이름으로 바꿈
# 3. 그리고 -4번째 인덱스를 갖는 원소와
# 4. 리스트의 첫번째 문자열('') 데이터 출력

val = [1, 9, 'one', 'two', 3, 'three']

val.remove('three')
val.append('jh')

print(val[-4])

for i in range(len(val)):
    if type(val[i]) == str:
        print(val[i])
        break

print(len(val))

one
one
6

In [8]:
# 실습10 수업 답안

val = [1, 9, 'one', 'two', 3, 'three']

val[-1] = 'jh'

print(val[-4])

for i in val:
    if type(i) == str:
        print(i)
        break

one
one

In [9]:
# 실습10 수업 답안 2

for i in val:
    if type(i) == str:
        find_str = i
        print(i)
        break

one

In [10]:
# 인덱스-값 형태의 리스트 구성

for i in enumerate(val):
    print(i)

(0, 1)
(1, 9)
(2, 'one')
(3, 'two')
(4, 3)
(5, 'jh')

In [11]:
find_str = []

for i in val:
    if type(i) == str:
        find_str.append(i)
print(find_str)

['one', 'two', 'jh']

In [12]:
# 실습11 섭씨를 화씨로 변환
# 1. 화면에서 섭씨 온도를 입력 받아
# 2. 섭씨온도를 화씨온도로 변환
# 화씨 = ( 9/5) * 섭씨온도 + 32
# 출력예 '섭씨온도 **는 화씨 **도입니다.'

# c = float(input('섭씨온도를 입력해주세요. '))
# f = round(9/5 * c + 32, 2)
# print('섭씨온도 {}도는 화씨온도 {}도 입니다.'.format(c, f))

In [13]:
# 실습11 수업 답안

# c = float(input())
# f = (9/5) * c + 32
# print('섭씨온도 %s도는 화씨온도 %.2f도 입니다.'%(c, f))

In [14]:
# 실습12 딕셔너리에서 값이 78인 key 찾아 출력

d = {'1':[60,80,30],'2':[78,54,98], '3' : [100,50,70],'4' : [70,60,80]}

for i in d:
    for j in d[i]:
        if j == 78:
            print('key =', i)

key = 2

In [15]:
# 실습12 수업 답안
score = 80
find_key = []

for i in d.items():
    for j in i[1]:
        if j == score:
            print('key =', i[0])
            find_key.append(i[0]) # 결과값 리스트 구성

            
print('find_key = ', find_key)
# 모듈을 구성할 때 코드블록은 되도록 수정하지 않도록 구성

key = 1
key = 4
find_key =  ['1', '4']

In [16]:
# 실습12 수업 답안2

score = 80
find_key = []

for i in d.items():
    if score in i[1]: # 비교연산자 in 활용
        print('key =', i[0])
        find_key.append(i[0]) # 결과값 리스트 구성

            
print('find_key = ', find_key)

key = 1
key = 4
find_key =  ['1', '4']

# 함수 def

1. 반복적으로 쓰는 코드를 모아서 동작시키는 기능
2. def func():
       코드1
       코드2
       ...
       [return a]

In [17]:
# 인자 없는 실행 함수

def prt(): # prt만 입력하면 함수 존재 확인
    print('111')
    print('222')
    print('333')
    
prt()

111
222
333

In [18]:
# 인자를 받아서 실행하는 함수
# 인자의 개수가 다르면 오류
# 함수 안에서만 동작

def sum(a, b):
    c = a + b
    print(c)
    
sum(5, 8)

13

In [19]:
# 인자를 받아서 실행 후 결과값을 반환하는 함수

def fun(x, y):
    z = x * y
    print('z =', z)
    return z

fun(3, 6)

res = fun(3, 8)
print('res = ', res)

z = 18
z = 24
res =  24

In [20]:
def fun1(x, y):
    z = x*y
    print(z)
    return x+y, z*y, x-y

fun1(5, 8)

40

(13, 320, -3)

In [21]:
a, b, c, = fun1(5, 8)

print(a)
print(b)
print(c)

40
13
320
-3

In [22]:
def fun3(x, y):
    a = x+y
    b = x*y
    c = x-y
    return a, b, c

fun3(3, 5)

(8, 15, -2)

In [23]:
# 온도변환 함수 만들기

def cel_to_fah(c):
    f = 9/5 * c + 32
    return f

cel_to_fah(32.2)

89.96000000000001

In [24]:
def sum_many(*args): # 여러개의 인자를 넣고 싶을 때 * 사용, args 권장
    print('args =', args)
    sum = 0
    for i in args:
        sum += i
        return sum

In [25]:
sum_many(1, 3, 5, 7)

args = (1, 3, 5, 7)

1

In [26]:
# key:value 로 받는 방식, **kwargs

def name(**kwargs):
    print('kwargs =', kwargs)
    for item in kwargs.items():
        print('{} = {}'.format(item[0], item[1]))

In [27]:
name(aa='123', bb='456')

kwargs = {'aa': '123', 'bb': '456'}
aa = 123
bb = 456

In [28]:
def name1(**kwargs1):
    print('kwargs1 =', kwargs1)
    
name1(aa='34534')
name1(jfaoijeof=234)
name1(abce = 'wefjoiwejfo', sdfsdf = 213242, fjweiof = '2342')

kwargs1 = {'aa': '34534'}
kwargs1 = {'jfaoijeof': 234}
kwargs1 = {'abce': 'wefjoiwejfo', 'sdfsdf': 213242, 'fjweiof': '2342'}

In [29]:
# 예시

def std_arg(arg):
    print("std_arg = ", arg)
def pos_only_arg(arg,/): # ,/ 포지션 값만 받음
    print("pos_only_arg = ", arg)
def kwd_only_arg(*, arg):
    print("kwd_only_arg = ", arg)
def combined_example(pos_only, /, standard, *, kwd_only):
    print(pos_only, standard, kwd_only)

In [30]:
std_arg(2)

std_arg(arg=2) # 숫자만 받아감

# std_arg(aa=2) # 이해하지 못함

pos_only_arg(1)

# pos_only_arg(arg=1) # ,/ 포지션값만 받기 때문에 오류

combined_example(1, 2, kwd_only = 3)

# combined_example(1, 2, 3) 오류 발생

std_arg =  2
std_arg =  2
pos_only_arg =  1
1 2 3

In [31]:
# 실습

def cv_fah(x):
    y = 9/5 * x + 32
    return y

# 1. 화면에서 입력받아 화씨 출력

# x = float(input('섭씨 온도는? '))
# y = round(cv_fah(x), 2)

# print('섭씨 {}도는 화씨 {}도입니다.'.format(x, y))

In [32]:
x = [25, 20, 32, 34, 19]

for i in x:
    y = round(cv_fah(i), 2)
    print('섭씨 %s도는 화씨 %.2f도입니다.'%(i, y))

섭씨 25도는 화씨 77.00도입니다.
섭씨 20도는 화씨 68.00도입니다.
섭씨 32도는 화씨 89.60도입니다.
섭씨 34도는 화씨 93.20도입니다.
섭씨 19도는 화씨 66.20도입니다.

In [33]:
# 실습 화씨 데이터 저장

x = [25, 20, 32, 34, 19]
y1 = []

for i in x:
    y = round(cv_fah(i), 2)
    y1.append(y)
    print('섭씨 %s도는 화씨 %.2f도입니다.'%(i, y))
    print('y1 =', y1)

섭씨 25도는 화씨 77.00도입니다.
y1 = [77.0]
섭씨 20도는 화씨 68.00도입니다.
y1 = [77.0, 68.0]
섭씨 32도는 화씨 89.60도입니다.
y1 = [77.0, 68.0, 89.6]
섭씨 34도는 화씨 93.20도입니다.
y1 = [77.0, 68.0, 89.6, 93.2]
섭씨 19도는 화씨 66.20도입니다.
y1 = [77.0, 68.0, 89.6, 93.2, 66.2]

In [34]:
# 실습 섭씨 30도 이상인 화씨 데이터만 저장

x = [25, 20, 32, 34, 19]
y2 = []

for i in x:
    if i >= 30:
        y = round(cv_fah(i), 2)
        y2.append(y)
        print('섭씨 %s도는 화씨 %.2f도입니다.'%(i, y))
        print('y2 =', y2)

섭씨 32도는 화씨 89.60도입니다.
y2 = [89.6]
섭씨 34도는 화씨 93.20도입니다.
y2 = [89.6, 93.2]

In [35]:
# 리스트 comp 방식 적용, 연습+중요
# [반복실행문장 for 반복변수 in 반복범위]

[cv_fah(i) for i in x]

[77.0, 68.0, 89.6, 93.2, 66.2]

# pandas

대용량 데이터 분석, 처리 라이브러리

교재, pandas doc 10 minute 활용

pds만의 데이터 구조; Series, DataFrame

In [36]:
# series 데이터 구조; 구조, 생성, 수정, 삭제

import pandas # pds 불러오기, pandas. 으로 함수 사용 가능

import pandas as pd # pd. 으로 함수 사용

from pandas import Series, DataFrame
# pd 라이브러리 내에서 Series, Dataframe 클래스 불러오기
# 클래스 이름은 대소문자 구분
# 클래스; 함수(코드들의 집합)들의 집합
# 모듈(라이브러리); 클래스의 집합
# from module(lib) import class

In [37]:
# Series 생성

from pandas import Series, DataFrame

Series(data = [2500, 3800, 1200, 6000],
       index = ['apple', 'banana', 'peer', 'cherry'])
# Series 데이터의 기본 형태

apple     2500
banana    3800
peer      1200
cherry    6000
dtype: int64

In [38]:
# Series 생성; import pandas as pd 로 불러왔을 때
pd.Series([2500, 3800, 1200, 6000],
          index = ['apple', 'banana', 'peer', 'cherry'])
# [data =]는 생략 가능

# 새로운 변수에 클래스 할당
# 할당했을 때 클래스의 기능을 상속받음; 객체 지향적
fruit = pd.Series(data = [2500, 3800, 1200, 6000],
                  index = ['apple', 'banana', 'peer', 'cherry'])

data = [2500, 3800, 1200, 6000]
value = ['apple', 'banana', 'peer', 'cherry']

fruit = pd.Series(data = data,
                  index = value)

print(fruit.values) # 데이터 추출
print(fruit.index) # 인덱스 추출

[2500 3800 1200 6000]
Index(['apple', 'banana', 'peer', 'cherry'], dtype='object')

In [39]:
# 딕셔너리를 시리즈로 컨버팅

fruitData = {'apple':2500, 'banana':3800, 'peer':1200, 'cherry':6000}

fruit = pd.Series(fruitData)

print(type(fruitData))
print(type(fruit)) # pd 시리즈 데이터 타입

<class 'dict'>
<class 'pandas.core.series.Series'>

In [40]:
fruit.name = 'fruitPrice' # 시리즈의 이름 명명
fruit.index.name = 'fruitName' # 시리즈 인덱스의 이름

print(fruit)

fruit.index

fruitName
apple     2500
banana    3800
peer      1200
cherry    6000
Name: fruitPrice, dtype: int64

Index(['apple', 'banana', 'peer', 'cherry'], dtype='object', name='fruitName')

In [41]:
# DataFrame; 시리즈는 하나의 열 형태, 데이터프레임은 열이 여러개 모인 구조
# DateFrame 생성
# 인덱스와 값의 갯수들이 동일해야 함
# 키가 컬럼명, 나머지가 데이터

fruitData = {'fruitName':['apple', 'banana', 'cherry', 'peer'],
            'fruitPrice':[2500, 3800, 6000, 1200],
            'num':[10, 5, 3, 8]}

fruitFrame = pd.DataFrame(fruitData)

print(type(fruitFrame)) # pd의 데이터프레임 구조

fruitFrame

<class 'pandas.core.frame.DataFrame'>

  fruitName  fruitPrice  num
0     apple        2500   10
1    banana        3800    5
2    cherry        6000    3
3      peer        1200    8

In [42]:
# 컬럼 순서 설정하는 방법

fruitFrame = pd.DataFrame(fruitData, columns = ['fruitPrice', 'num', 'fruitName'])

fruitFrame

   fruitPrice  num fruitName
0        2500   10     apple
1        3800    5    banana
2        6000    3    cherry
3        1200    8      peer

In [43]:
# 데이터 추출; dtFm[key] or dtFm.key
# 시리즈 형태로 출력

print(fruitFrame['fruitName'])

print(fruitFrame.fruitName)

0     apple
1    banana
2    cherry
3      peer
Name: fruitName, dtype: object
0     apple
1    banana
2    cherry
3      peer
Name: fruitName, dtype: object

In [44]:
# 컬럼 추가; dtFm[key] = val

fruitFrame['year'] = 2016

print(fruitFrame)

# 인덱스를 지정해서 컬럼/값 추가
variable = pd.Series([4, 2, 1], index = [0, 2, 3])
fruitFrame['stock'] = variable

print(fruitFrame)

   fruitPrice  num fruitName  year
0        2500   10     apple  2016
1        3800    5    banana  2016
2        6000    3    cherry  2016
3        1200    8      peer  2016
   fruitPrice  num fruitName  year  stock
0        2500   10     apple  2016    4.0
1        3800    5    banana  2016    NaN
2        6000    3    cherry  2016    2.0
3        1200    8      peer  2016    1.0

In [45]:
# 데이터 구조의 항목 삭제
# 시리즈의 row 삭제

fruit = pd.Series([2500,3800,1200,6000],
                  index=['apple','banana','peer','cherry'])
new_fruit = fruit.drop('banana')
print(fruit)
print(new_fruit)

apple     2500
banana    3800
peer      1200
cherry    6000
dtype: int64
apple     2500
peer      1200
cherry    6000
dtype: int64

In [46]:
# df의 row 삭제

fruitData = {'fruitName':['apple', 'banana', 'cherry', 'peer'],
            'fruitPrice':[2500, 3800, 6000, 1200],
            'num':[10, 5, 3, 8]}

fruitName = fruitData['fruitName'] # 딕셔너리 처리, 별도의 인덱스 데이터화

fruitFrame = pd.DataFrame(fruitData,
                          index = fruitName,
                          columns = ['fruitPrice', 'num']) # 인덱스를 부여

print(fruitFrame)

fruitFrame2 = fruitFrame.drop(['apple', 'cherry'])
fruitFrame2

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
peer          1200    8

        fruitPrice  num
banana        3800    5
peer          1200    8

In [47]:
# 컬럼 삭제

fruitFrame.drop('num', axis = 1) # axis = 0 열, = 1 행 기준
# axis 설정하지 않으면 0이 기본값

fruitFrame3 = fruitFrame.drop('num', axis = 1)
fruitFrame3

        fruitPrice
apple         2500
banana        3800
cherry        6000
peer          1200

In [48]:
# 여러 컬럼 지우기, 영구적 수정은 아님

fruitFrame.drop(['num', 'fruitPrice'], axis = 1)

Empty DataFrame
Columns: []
Index: [apple, banana, cherry, peer]

In [49]:
tmp = fruitFrame.copy()

print(tmp.drop('num', axis = 1))

# inplace False(기본값)면 데이터 미수정, True면 영구적 수정
tmp.drop('num', axis = 1, inplace = True)

tmp

        fruitPrice
apple         2500
banana        3800
cherry        6000
peer          1200

        fruitPrice
apple         2500
banana        3800
cherry        6000
peer          1200

In [50]:
# 항목 추출
data = [2500, 3800, 1200, 6000]
value = ['apple', 'banana', 'peer', 'cherry']

fruit = pd.Series(data = data,
                 index = value)

# [a:b] a부터 b가지 슬라이싱
fruit['apple':'peer']

fruitFrame

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
peer          1200    8

In [51]:
fruitData = {'fruitName':['apple', 'banana', 'cherry', 'peer'],
            'fruitPrice':[2500, 3800, 6000, 1200],
            'num':[10, 5, 3, 8]}

fruitName = fruitData['fruitName']
fruitFrame = pd.DataFrame(fruitData,
                         index = fruitName,
                         columns = ['fruitPrice', 'num'])

fruitFrame

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
peer          1200    8

In [52]:
pd.DataFrame(fruitData, index = fruitName)

       fruitName  fruitPrice  num
apple      apple        2500   10
banana    banana        3800    5
cherry    cherry        6000    3
peer        peer        1200    8

In [53]:
fruitFrame['fruitPrice']

apple     2500
banana    3800
cherry    6000
peer      1200
Name: fruitPrice, dtype: int64

In [54]:
fruitFrame['apple':'banana']

        fruitPrice  num
apple         2500   10
banana        3800    5

In [55]:
# 시리즈 연산
fruit1 = pd.Series([5, 9, 10, 3],
                   index = ['apple', 'banana', 'cherry', 'peer'])
fruit2 = pd.Series([3, 2, 9, 5, 10],
                   index = ['apple', 'orange', 'banana', 'cherry', 'mango'])

print(fruit1 + fruit2) # 인덱스가 겹치면 더하고 그렇지 않으면 Nan

apple      8.0
banana    18.0
cherry    15.0
mango      NaN
orange     NaN
peer       NaN
dtype: float64

In [56]:
# df 연산
# 딕셔너리를 시리즈로 변환
fd1 = {"Ohio":[4, 8, 3, 5], "Texas":[0,1,2,3]}
df1 = pd.DataFrame(data = fd1,
                   columns = ["Ohio", "Texas"], 
                   index = ["ap", "ba", "ch", "pe"])
fd2 = {"Ohio":[3, 0, 2, 1, 7], "Colorado":[5, 4, 3, 6, 0]}
df2 = pd.DataFrame(data = fd2,
                   columns = ["Ohio", "Colorado"], 
                   index = ["ap", "or", "ba", "ch", "ma"])

print(df1 + df2)
# 인덱스와 컬럼이 같을 경우만 연산, 아니면 Nan

    Colorado  Ohio  Texas
ap       NaN   7.0    NaN
ba       NaN  10.0    NaN
ch       NaN   4.0    NaN
ma       NaN   NaN    NaN
or       NaN   NaN    NaN
pe       NaN   NaN    NaN

In [57]:
# srs 정렬
data = [2500, 3800, 1200, 6000]
value = ['apple', 'banana', 'peer', 'cherry']

fruit = pd.Series(data = data,
                 index = value)

print(fruit.sort_values()) # 데이터 정렬, 기본값 오름차순
print(fruit.sort_values(ascending = False)) # 내림차순

peer      1200
apple     2500
banana    3800
cherry    6000
dtype: int64
cherry    6000
banana    3800
apple     2500
peer      1200
dtype: int64

In [58]:
# df 정렬
print(fruitFrame.sort_index()) # 오름차순
print(fruitFrame.sort_index(ascending = False)) # 내림차순

print(fruitFrame.sort_index(axis = 1, ascending = False)) # 행, 내림차순 

print(fruitFrame.sort_values(['fruitPrice'])) # 데이터 정렬은 특정 컬럼 기준으로
print(fruitFrame.sort_values(by = ['fruitPrice'])) # by= 생략가능
print(fruitFrame.sort_values(['fruitPrice'], ascending = False))

        fruitPrice  num
apple         2500   10
banana        3800    5
cherry        6000    3
peer          1200    8
        fruitPrice  num
peer          1200    8
cherry        6000    3
banana        3800    5
apple         2500   10
        num  fruitPrice
apple    10        2500
banana    5        3800
cherry    3        6000
peer      8        1200
        fruitPrice  num
peer          1200    8
apple         2500   10
banana        3800    5
cherry        6000    3
        fruitPrice  num
peer          1200    8
apple         2500   10
banana        3800    5
cherry        6000    3
        fruitPrice  num
cherry        6000    3
banana        3800    5
apple         2500   10
peer          1200    8

In [59]:
# 데이터

fruit1 = pd.Series([5, 9, 10, 3],
                   index = ['apple', 'banana', 'cherry', 'peer'])
fruit2 = pd.Series([3, 2, 9, 5, 10],
                   index = ['apple', 'orange', 'banana', 'cherry', 'mango'])


fd1 = {"Ohio":[4, 8, 3, 5], "Texas":[0,1,2,3]}
df1 = pd.DataFrame(data = fd1,
                   columns = ["Ohio", "Texas"], 
                   index = ["ap", "ba", "ch", "pe"])
fd2 = {"Ohio":[3, 0, 2, 1, 7], "Colorado":[5, 4, 3, 6, 0]}
df2 = pd.DataFrame(data = fd2,
                   columns = ["Ohio", "Colorado"], 
                   index = ["ap", "or", "ba", "ch", "ma"])




data = [2500, 3800, 1200, 6000]
value = ['apple', 'banana', 'peer', 'cherry']

fruitData = {'apple':2500, 'banana':3800, 'peer':1200, 'cherry':6000}

fruitData = {'fruitName':['apple', 'banana', 'cherry', 'peer'],
            'fruitPrice':[2500, 3800, 6000, 1200],
            'num':[10, 5, 3, 8]}

# 교재 활용 사례 맛보기

함수
count
min, max
sum
cumprod
mean
median

quantile
Var
std
Describe

In [60]:
# 데이터 불러오기

import pandas as pd

# 웹에서 데이터 읽어오기
url = "http://freakonometrics.free.fr/german_credit.csv"
german = pd.read_csv(url)

# 다운받은 파일 읽어오기 (오류가 생기면 \ / 수정)
# german = pd.read_csv("C:\jhpark\sync\python\pandas\german_credit.csv")

## df 읽어 온 후 반드시 해야 할 8가지

In [61]:
# 1. 첫 6개 데이터 조회; df.head(n); n개의 행 조회
german.head()

german

,Creditability,Account Balance,Duration of Credit (month),Payment Status of Previous Credit,Purpose,Credit Amount,Value Savings/Stocks,Length of current employment,Instalment per cent,Sex & Marital Status,...,Duration in Current address,Most valuable available asset,Age (years),Concurrent Credits,Type of apartment,No of Credits at this Bank,Occupation,No of dependents,Telephone,Foreign Worker
0,1,1,18,4,2,1049,1,2,4,2,...,4,2,21,3,1,1,3,1,1,1
1,1,1,9,4,0,2799,1,3,2,3,...,2,1,36,3,1,2,3,2,1,1
2,1,2,12,2,9,841,2,4,2,2,...,4,1,23,3,1,1,2,1,1,1
3,1,1,12,4,0,2122,1,3,3,3,...,2,1,39,3,1,2,2,2,1,2
4,1,1,12,4,0,2171,1,3,4,3,...,4,2,38,1,2,2,2,1,1,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,0,1,24,2,3,1987,1,3,2,3,...,4,1,21,3,1,1,2,2,1,1
996,0,1,24,2,0,2303,1,5,4,3,...,1,1,45,3,2,1,3,1,1,1
997,0,4,21,4,0,12680,5,5,4,3,...,4,4,30,3,3,1,4,1,2,1
998,0,2,12,2,3,6468,5,1,2,3,...,1,4,52,3,2,1,4,1,2,1
999,0,1,30,2,2,6350,5,5,4,3,...,4,2,31,3,2,1,3,1,1,1

In [62]:
# 2. df 정보; df.shape; 건수, 컬럼수; df.shape[]에 0 행, 1 열 갯수
german.shape

(1000, 21)

In [63]:
# 3. 컬럼이름; df.columns; 컬럼을 리스트로 받음
print(german.columns[:5])
print(list(german.columns)[:5])
german.columns.values[0:5]

Index(['Creditability', 'Account Balance', 'Duration of Credit (month)',
       'Payment Status of Previous Credit', 'Purpose'],
      dtype='object')
['Creditability', 'Account Balance', 'Duration of Credit (month)', 'Payment Status of Previous Credit', 'Purpose']

array(['Creditability', 'Account Balance', 'Duration of Credit (month)',
       'Payment Status of Previous Credit', 'Purpose'], dtype=object)

In [64]:
# 4. df 구조; df.info();
german.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 21 columns):
 #   Column                             Non-Null Count  Dtype
---  ------                             --------------  -----
 0   Creditability                      1000 non-null   int64
 1   Account Balance                    1000 non-null   int64
 2   Duration of Credit (month)         1000 non-null   int64
 3   Payment Status of Previous Credit  1000 non-null   int64
 4   Purpose                            1000 non-null   int64
 5   Credit Amount                      1000 non-null   int64
 6   Value Savings/Stocks               1000 non-null   int64
 7   Length of current employment       1000 non-null   int64
 8   Instalment per cent                1000 non-null   int64
 9   Sex & Marital Status               1000 non-null   int64
 10  Guarantors                         1000 non-null   int64
 11  Duration in Current address        1000 non-null   int64
 12  Most valuable available asset      1000 non-null   int64
 13  Age (years)                        1000 non-null   int64
 14  Concurrent Credits                 1000 non-null   int64
 15  Type of apartment                  1000 non-null   int64
 16  No of Credits at this Bank         1000 non-null   int64
 17  Occupation                         1000 non-null   int64
 18  No of dependents                   1000 non-null   int64
 19  Telephone                          1000 non-null   int64
 20  Foreign Worker                     1000 non-null   int64
dtypes: int64(21)
memory usage: 164.2 KB

In [65]:
# 5. 마지막 n개 데이터 확인; df.tail(n)
german.tail(5)

,Creditability,Account Balance,Duration of Credit (month),Payment Status of Previous Credit,Purpose,Credit Amount,Value Savings/Stocks,Length of current employment,Instalment per cent,Sex & Marital Status,...,Duration in Current address,Most valuable available asset,Age (years),Concurrent Credits,Type of apartment,No of Credits at this Bank,Occupation,No of dependents,Telephone,Foreign Worker
995,0,1,24,2,3,1987,1,3,2,3,...,4,1,21,3,1,1,2,2,1,1
996,0,1,24,2,0,2303,1,5,4,3,...,1,1,45,3,2,1,3,1,1,1
997,0,4,21,4,0,12680,5,5,4,3,...,4,4,30,3,3,1,4,1,2,1
998,0,2,12,2,3,6468,5,1,2,3,...,1,4,52,3,2,1,4,1,2,1
999,0,1,30,2,2,6350,5,5,4,3,...,4,2,31,3,2,1,3,1,1,1

In [66]:
# 6. 결측치 확인; df.isnull(); null인 데이터 false
german.isnull() # 전체 데이터
print(german.isnull().sum()) # 컬럼별로
print(german.isnull().sum().sum()) # 전체 결측치

Creditability                        0
Account Balance                      0
Duration of Credit (month)           0
Payment Status of Previous Credit    0
Purpose                              0
Credit Amount                        0
Value Savings/Stocks                 0
Length of current employment         0
Instalment per cent                  0
Sex & Marital Status                 0
Guarantors                           0
Duration in Current address          0
Most valuable available asset        0
Age (years)                          0
Concurrent Credits                   0
Type of apartment                    0
No of Credits at this Bank           0
Occupation                           0
No of dependents                     0
Telephone                            0
Foreign Worker                       0
dtype: int64
0

In [67]:
# 7. 요약 통계량 확인; df.describe()
german.describe()

,Creditability,Account Balance,Duration of Credit (month),Payment Status of Previous Credit,Purpose,Credit Amount,Value Savings/Stocks,Length of current employment,Instalment per cent,Sex & Marital Status,...,Duration in Current address,Most valuable available asset,Age (years),Concurrent Credits,Type of apartment,No of Credits at this Bank,Occupation,No of dependents,Telephone,Foreign Worker
count,1000.000000,1000.000000,1000.000000,1000.00000,1000.000000,1000.00000,1000.000000,1000.000000,1000.000000,1000.00000,...,1000.000000,1000.000000,1000.00000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000
mean,0.700000,2.577000,20.903000,2.54500,2.828000,3271.24800,2.105000,3.384000,2.973000,2.68200,...,2.845000,2.358000,35.54200,2.675000,1.928000,1.407000,2.904000,1.155000,1.404000,1.037000
std,0.458487,1.257638,12.058814,1.08312,2.744439,2822.75176,1.580023,1.208306,1.118715,0.70808,...,1.103718,1.050209,11.35267,0.705601,0.530186,0.577654,0.653614,0.362086,0.490943,0.188856
min,0.000000,1.000000,4.000000,0.00000,0.000000,250.00000,1.000000,1.000000,1.000000,1.00000,...,1.000000,1.000000,19.00000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000
25%,0.000000,1.000000,12.000000,2.00000,1.000000,1365.50000,1.000000,3.000000,2.000000,2.00000,...,2.000000,1.000000,27.00000,3.000000,2.000000,1.000000,3.000000,1.000000,1.000000,1.000000
50%,1.000000,2.000000,18.000000,2.00000,2.000000,2319.50000,1.000000,3.000000,3.000000,3.00000,...,3.000000,2.000000,33.00000,3.000000,2.000000,1.000000,3.000000,1.000000,1.000000,1.000000
75%,1.000000,4.000000,24.000000,4.00000,3.000000,3972.25000,3.000000,5.000000,4.000000,3.00000,...,4.000000,3.000000,42.00000,3.000000,2.000000,2.000000,3.000000,1.000000,2.000000,1.000000
max,1.000000,4.000000,72.000000,4.00000,10.000000,18424.00000,5.000000,5.000000,4.000000,4.00000,...,4.000000,4.000000,75.00000,3.000000,3.000000,4.000000,4.000000,2.000000,2.000000,2.000000

In [68]:
# 8. 특정 컬럼(변수) 분석; df[cl]; 대소문자 구분; df[cl].value_counts()
german['Purpose']
german.Purpose

# 각 요소마다 건수를 더해줌; 연속형 변수에서 의미가 없음
german['Purpose'].value_counts()

german['Purpose'].value_counts().sort_index() # 분포도, 히스토그램 활용시

german['Purpose'].value_counts().sort_values(ascending = False)

3     280
0     234
2     181
1     103
9      97
6      50
5      22
4      12
10     12
8       9
Name: Purpose, dtype: int64

In [69]:
# 실습01 german_sample df 만들기
# 4개 컬럼 추출해서 df 만들기; 'Creditability', 'Duration of Credit (month)','Purpose', 'Credit Amount'

german4 = pd.DataFrame(german,
                       columns = ['Creditability', 'Duration of Credit (month)',
                                  'Purpose', 'Credit Amount'])
german4
# german_sample.min()

     Creditability  Duration of Credit (month)  Purpose  Credit Amount
0                1                          18        2           1049
1                1                           9        0           2799
2                1                          12        9            841
3                1                          12        0           2122
4                1                          12        0           2171
..             ...                         ...      ...            ...
995              0                          24        3           1987
996              0                          24        0           2303
997              0                          21        0          12680
998              0                          12        3           6468
999              0                          30        2           6350

[1000 rows x 4 columns]

In [70]:
# 실습01 수업 답안

# 하나일 때는 [], 두개 이상일 때는 리스트[ ]로 묶어줘야 함
german_sample = german[['Creditability', 'Duration of Credit (month)',
                        'Purpose', 'Credit Amount']]
german_sample

     Creditability  Duration of Credit (month)  Purpose  Credit Amount
0                1                          18        2           1049
1                1                           9        0           2799
2                1                          12        9            841
3                1                          12        0           2122
4                1                          12        0           2171
..             ...                         ...      ...            ...
995              0                          24        3           1987
996              0                          24        0           2303
997              0                          21        0          12680
998              0                          12        3           6468
999              0                          30        2           6350

[1000 rows x 4 columns]

In [71]:
# 최댓값
german_sample.max()

Creditability                     1
Duration of Credit (month)       72
Purpose                          10
Credit Amount                 18424
dtype: int64

In [72]:
# 평균
german_sample.mean()

Creditability                    0.700
Duration of Credit (month)      20.903
Purpose                          2.828
Credit Amount                 3271.248
dtype: float64

In [73]:
german_sample.describe()

       Creditability  Duration of Credit (month)      Purpose  Credit Amount
count    1000.000000                 1000.000000  1000.000000     1000.00000
mean        0.700000                   20.903000     2.828000     3271.24800
std         0.458487                   12.058814     2.744439     2822.75176
min         0.000000                    4.000000     0.000000      250.00000
25%         0.000000                   12.000000     1.000000     1365.50000
50%         1.000000                   18.000000     2.000000     2319.50000
75%         1.000000                   24.000000     3.000000     3972.25000
max         1.000000                   72.000000    10.000000    18424.00000